### Задание

**Цель занятия:**
Познакомиться с основами языка программирования Python, его типами данных и научиться создавать простые программы. В процессе выполнения заданий вы установите Python на свой компьютер, изучите историю Python, основные типы данных, а также научитесь работать со строками, числами и переменными.

---

**Задание:**
Выполните обязательные пункты (1–5), а затем выберите любое задание из пунктов 6–13.

Требование к отчёту: ваш код обязан запускаться и выполняться на любой машине и в любом окружении.

### **Обязательные задания:**

1. **Изучите историю Python.**
   - Ознакомьтесь с историей создания Python: кто создал язык, основные этапы его развития, и почему он стал популярным. Найти информацию можно в официальной [документации Python](https://docs.python.org/) или в интернете.

2. **Установите Python.**
   - Скачайте и установите последнюю версию Python с [официального сайта](https://www.python.org/downloads/). Следуйте инструкциям, описанным в документации для вашей операционной системы.

3. **Изучите типы данных Python.**
   - Ознакомьтесь с основными типами данных в Python: строки (`str`), числа (`int`, `float`), логические значения (`bool`), списки (`list`), словари (`dict`) и другие. Постарайтесь понять, как они используются.

4. **Напишите программу, которая выводит фразу «Привет, мир!».**
   - Это базовая программа, которая поможет вам познакомиться с функцией вывода (`print`).

***Реализация:***

   ```Python
   print("Привет,, мир!")
   ```

5. **Напишите программу, которая вычисляет сумму 2 + 2 и выводит результат.**
   - Программа должна использовать операцию сложения и выводить ответ на экран с помощью функции `print`.

***Реализация:***

   ```Python 
   a = 2
   b = 2

   sum = a + b

   print(sum)
   ```
   

6. **Программа приветствия:**
   - Напишите программу, которая запрашивает у пользователя его имя и выводит сообщение: «Привет, [имя]!».

***Реализация:***
   ```Python
   name = input("Введите ваше имя:")

   print("Привет, " + name + "!")
   ```

7. **Числовой вывод:**
   - Создайте программу, которая выводит на экран числа от 1 до 10.

***Реализация:***
   ```Python
      age = input("Введите ваш возраст:")

      print("Ваш возраст - " + age + " лет.")   
   ```

8. **Определение возраста:**
   - Напишите программу, которая запрашивает возраст пользователя и выводит сообщение: «Ваш возраст — [возраст] лет».

***Реализация:***
   ```Python
      i = 1
      while i <= 10:
         print(i)
         i += 1
   ```

9. **Произведение чисел:**
   - Напишите программу, которая запрашивает у пользователя два числа и выводит их произведение.

***Реализация:***
   ```Python
   a = float(input("Введите первое число:"))
   b = float(input("Введите второе число:"))

result = (a * b)
print(round(result, 2))
   ```

10. **Первая буква слова:**
    - Создайте программу, которая запрашивает у пользователя слово и выводит его первую букву.

***Реализация:***
```Python
   word = input("Введите слово:")

   if word:
      print(f"Первая буква: {word[0]}.")
   else:
      print(f"Вы ничего не ввели.")
```

11. **Квадрат числа:**
    - Напишите программу, которая запрашивает у пользователя целое число и выводит его квадрат.

***Реализация:***
Реализовано возведение в произвольную степень
```Python
   import math

   number = float(input("Введите число:"))
   power = int(input("Введите степень:"))

   result = math.pow(number, power)
   print(f"{number} в степени {power} равно {result:.2f}") 
```
    
12. **Таблица умножения:**
    - Создайте программу, которая выводит таблицу умножения на число 5 (от 1 до 10).
    
 ***Реализация:***
   ```Python
   number = 5

   for i in range(1,11):
      print(f"{number} x {i} = {number * i}") 
   ```   

13. **Среднее арифметическое:**
    - Напишите программу, которая запрашивает у пользователя два числа и выводит их среднее арифметическое.

***Реализация:***
   ```Python
   import statistics

   number1 = float(input("Введите первое число:"))
   number2 = float(input("Введите второе число:"))

   numbers = [number1, number2]
   average_number = statistics.mean(numbers)
   print(f"{average_number:.1f}")   
   ```